# GetMinimumListStartNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetMinimumListStartNumber Method
FormattedText Class See Also
---
Returns the minumum allowed list start number.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int GetMinimumListStartNumber()
```

Visual Basic
---
```text
Public Function GetMinimumListStartNumber As Integer
```

Visual C++
---
```text
public:
int GetMinimumListStartNumber()
```

# See Also
FormattedText Class
Autodesk.Revit.DB Namespace